app/controllers/comments_controller.rb

    def create
        comment = @restaurant.comments.new(comment_params)
        comment.user_id = current_user.id
        if comment.save
---
INSERT INTO `comments` (`comment`, `restaurant_id`, `user_id`, `created_at`, `updated_at`) VALUES ('おもろ', 1, 1, '2019-08-15 11:01:54', '2019-08-15 11:01:54')

    def destroy
        comment = Comment.find(params[:id])
        comment.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 3 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 3

    def set_restaurant
      @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 2 LIMIT 1