app/controllers/likes_controller.rb

  def create
    @restaurant = Restaurant.find_or_initialize_by(g_id:params[:restaurant_g_id])

    unless @restaurant.persisted?

      url = 'https://api.gnavi.co.jp/RestSearchAPI/v3/'

      serch = {
        keyid: '4cd1a81fec528e1c5fc0dfa8ca16e7a2',
        id: @restaurant[:g_id]

      }

      conn = Faraday.new(url: url)
      res = conn.get '', serch
      response_json = JSON.parse(res.body)
      rest = response_json['rest'][0]
      @restaurant = Restaurant.new(read(rest))
      @restaurant.save
---
SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`g_id` = 'gdy9510' LIMIT 1
INSERT INTO `restaurants` (`g_id`, `name`, `url`, `pc`, `shop_image1`, `pr_short`, `created_at`, `updated_at`, `latitude`, `longitude`) VALUES ('y844502', '肉のまごろく', 'https://r.gnavi.co.jp/j2516pyd0000/?ak=ecxX30%2Frd8RZshbyvRAuVdKT18rcmIvqVLdjov98dEc%3D', '', 'https://uds.gnst.jp/rest/img/j2516pyd0000/t_0002.jpg', 'パワーアップした肉盛り&試行錯誤を重ねた低温調理は必食 女子会や宴会に◎気軽に旨い肉が堪能できるお店♪ 【肉三昧】前菜から〆まで肉肉肉人気No. 1４０００円コース', '2019-08-15 04:41:32', '2019-08-15 04:41:32', 34.599887, 133.768723)

  def destroy

    @restaurant = Restaurant.find(params[:id])
---
SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 4 LIMIT 1