app/controllers/rankings_controller.rb

  def like
    @ranking_counts = Like.ranking
    @restaurants = Restaurant.find(@ranking_counts.keys)
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` IN (1, 2, 4)