app/controllers/restaurants_controller.rb

SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`g_id` = 'b749956' LIMIT 1
INSERT INTO `restaurants` (`g_id`, `name`, `url`, `pc`, `shop_image1`, `pr_short`, `created_at`, `updated_at`, `latitude`, `longitude`) VALUES ('gdy9510', '肉バル 肉ソン大統領 秋葉原店', 'https://r.gnavi.co.jp/a6gvj1vu0000/?ak=ecxX30%2Frd8RZshbyvRAuVdKT18rcmIvqVLdjov98dEc%3D', 'https://r.gnavi.co.jp/a6gvj1vu0000/coupon/', 'https://uds.gnst.jp/rest/img/a6gvj1vu0000/t_0n81.jpg', 'TBS王様のブランチの人気コーナー「ごはんクラブ」でキスマイの北山宏光さん、宮田俊哉さんによる「激ウマ！肉グルメを食べ尽くし」で紹介されました。', '2019-08-15 05:34:57', '2019-08-15 05:34:57', 35.697978, 139.776421)
---
  def new
    @restaurants,@latitude,@longitude = [],[],[]
    @freeword = params[:freeword]
    url = 'https://api.gnavi.co.jp/RestSearchAPI/v3/'
    params = {
      keyid: ENV['GURUNAVI_API_KEY'],
      freeword: @freeword
    }
    response = Faraday.get(url,params)
    response_json = JSON.parse(response.body)
    if response_json.present?
      begin
        response_json['rest'].each do |rest|
          restaurant = Restaurant.new(read(rest))
          if Restaurant.find_by(g_id: restaurant[:g_id])
            restaurant = Restaurant.find_by(g_id: restaurant[:g_id])
          else
            restaurant.save