app/controllers/restaurants_controller.rb

  def show
    @restaurant = Restaurant.find(params[:id])
    @latlng = [@restaurant[:latitude], @restaurant[:longitude]]
    @comment = @restaurant.comments.new
    @comments = @restaurant.comments.with_attached_images.includes(:user).order(created_at: :DESC)
    @comment_images = @comments.select{ |comment| comment.images.attached? }
---
SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`restaurant_id` = 1
SELECT `users`.* FROM `users` INNER JOIN `likes` ON `users`.`id` = `likes`.`user_id` WHERE `likes`.`restaurant_id` = 1