app/controllers/sessions_controller.rb

  def twitter_create
    user = User.find_or_create_from_auth(request.env['omniauth.auth'])
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `image`, `provider`, `uid`) VALUES ('ぐえもん@Udemy大学生', 'aiueo@gmail.com', '$2a$12$q9AJEYf4Q8LPoF42M95Jj.0EUXLUKOgJWLqNbKDZObGew4CBRY7zm', '2019-08-12 04:19:53', '2019-08-12 04:19:53', 'https://pbs.twimg.com/profile_images/1105381632402288640/Wy2_yIhr_bigger.jpg', 'twitter', '1085394187577630721')