app/controllers/toppages_controller.rb

  def index
    @restaurants = Restaurant.page(params[:page]).per(9)
---
SELECT  `restaurants`.* FROM `restaurants` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `restaurants`